export class Item {
  constructor(id, name, price, brand, count = 0) {
    this.id = id;
    this.name = name;
    this.price = price;
    this.count = count;
    this.brand = brand;
  }
}

export const allItems = [
  new Item(0, 'Зарубежные финики', 540910, 'lego'),
  new Item(1, 'Революционная солянка', 505396, 'adidas'),
  new Item(2, 'Древняя горбуша', 288443, null),
  new Item(3, 'Мировое варенье', 629290, 'lego'),
  new Item(4, 'Человеческие сухари', 633556, 'apple'),
  new Item(5, 'Коммунистическая сёмга', 742392, null),
  new Item(6, 'Энергетические блинчики', 181139, 'adidas'),
  new Item(7, 'Ровный лаваш', 999108, 'adidas'),
  new Item(8, 'Гранатовая хурма', 54286, 'lego'),
  new Item(9, 'Ключевые рулетики', 698351, 'apple'),
  new Item(10, 'Национальный лук', 963439, 'apple'),
  new Item(11, 'Европейские эклеры', 997804, 'lego'),
  new Item(12, 'Налоговое масло', 352804, 'adidas'),
  new Item(13, 'Аналогичный лаваш', 609150, null),
  new Item(14, 'Знаменитая сельдь', 81769, null),
  new Item(15, 'Положительный редис', 770236, 'adidas'),
  new Item(16, 'Крепкие пельмени', 563289, 'apple'),
  new Item(17, 'Тушёные овощи', 11657, 'lego'),
  new Item(18, 'Оранжевый гранат', 674972, 'Красная цена'),
  new Item(19, 'Пожилая айва', 121822, null),
  new Item(20, 'Идеальный сельдерей', 607377, 'adidas'),
  new Item(21, 'Турецкий сок', 345580, 'adidas'),
  new Item(22, 'Негативные отруби', 599350, null),
  new Item(23, 'Естественный сахар', 397757, null),
  new Item(24, 'Собственное масло', 452693, 'Красная цена'),
  new Item(25, 'Закрытое море', 871639, 'lego'),
  new Item(26, 'Пожилые пельмени', 481839, 'Красная цена'),
  new Item(27, 'Согласный помидор', 397634, 'Красная цена'),
  new Item(28, 'Жилые раки', 611735, null),
  new Item(29, 'Манговая лазанья', 99650, 'apple'),
  new Item(30, 'Похожая тыква', 947790, 'Красная цена'),
  new Item(31, 'Оперативная сарделька', 994453, 'lego'),
  new Item(32, 'Программные грибы', 977888, null),
  new Item(33, 'Крупное лето', 782265, 'adidas'),
  new Item(34, 'Восточные фисташки', 467872, 'lego'),
  new Item(35, 'Пьяная водка', 612520, null),
  new Item(36, 'Серьезная брюква', 182456, 'lego'),
  new Item(37, 'Скромные кольца', 169006, 'adidas'),
  new Item(38, 'Жесткая пшеница', 695141, 'lego'),
  new Item(39, 'Ягодные устрицы', 823432, 'apple'),
  new Item(40, 'Женское буррито', 830579, 'apple'),
  new Item(41, 'Картофельная айва', 894190, 'lego'),
  new Item(42, 'Письменный орех', 234456, 'lego'),
  new Item(43, 'Солнечный пельмень', 538397, 'adidas'),
  new Item(44, 'Широкий сахар', 467687, null),
  new Item(45, 'Сербский гранат', 25565, 'Красная цена'),
  new Item(46, 'Неожиданные галеты', 230062, 'Красная цена'),
  new Item(47, 'Электрическая вода', 364739, 'Красная цена'),
  new Item(48, 'Симпатичная сёмга', 886464, 'apple'),
  new Item(49, 'Погибшее пюре', 278009, 'Красная цена'),
  new Item(50, 'Молодое пюре', 360125, null),
];

export const descriptions = [
  'Практический опыт показывает, что сложившаяся структура организации требует от нас анализа дальнейших направлений развитая системы массового участия? Задача организации, в особенности же постоянный количественный рост и сфера нашей активности в значительной степени обуславливает создание системы масштабного изменения ряда параметров. Равным образом реализация намеченного плана развития обеспечивает актуальность позиций, занимаемых участниками в отношении поставленных задач! Таким образом, рамки и место обучения кадров позволяет выполнить важнейшие задания по разработке всесторонне сбалансированных нововведений. Дорогие друзья, рамки и место обучения кадров представляет собой интересный эксперимент проверки соответствующих условий активизации? С другой стороны выбранный нами инновационный путь представляет собой интересный эксперимент проверки существующих финансовых и административных условий. Практический опыт показывает, что постоянное информационно-техническое обеспечение нашей деятельности способствует повышению актуальности всесторонне сбалансированных нововведений? Равным образом новая модель организационной деятельности создаёт предпосылки качественно новых шагов для дальнейших направлений развития проекта? Таким образом, реализация намеченного плана развития позволяет оценить значение системы масштабного изменения ряда параметров! Таким образом, дальнейшее развитие различных форм деятельности обеспечивает актуальность системы обучения кадров, соответствующей насущным потребностям. Значимость этих проблем настолько очевидна, что сложившаяся структура организации способствует повышению актуальности дальнейших направлений развития проекта. Разнообразный и богатый опыт консультация с профессионалами из IT способствует повышению актуальности ключевых компонентов планируемого обновления? Таким образом, курс на социально-ориентированный национальный...',
  'Равным образом выбранный нами инновационный путь требует от нас системного анализа дальнейших направлений развития проекта. Дорогие друзья, курс на социально-ориентированный национальный проект обеспечивает актуальность дальнейших направлений развития проекта? Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции позволяет выполнить важнейшие задания по разработке модели развития. Задача организации, в особенности же новая модель организационной деятельности играет важную роль в формировании системы масштабного изменения ряда параметров. Разнообразный и богатый опыт дальнейшее развитие различных форм деятельности требует от нас анализа системы масштабного изменения ряда параметров. Не следует, однако, забывать о том, что постоянное информационно-техническое обеспечение нашей деятельности создаёт предпосылки качественно...',
  'Quis autem vel eum iure reprehenderit, quis nostrum exercitationem ullam corporis suscipit laboriosam, ut aut reiciendis voluptatibus maiores alias consequatur...',
  'Itaque earum rerum hic tenetur a sapiente delectus, consectetur adipiscing elit, obcaecati cupiditate non provident, similique sunt in culpa, qui officia deserunt mollitia animi, id est laborum et dolorum fuga! Duis aute irure dolor in reprehenderit in voluptate, consectetur adipiscing elit, qui dolorem ipsum, quia dolor sit, amet, consectetur, adipisci velit, sed quia non numquam eius modi tempora incidunt, ut labore et dolore magnam aliquam quaerat voluptatem. Temporibus autem quibusdam et aut officiis debitis aut rerum necessitatibus saepe eveniet, quia voluptas sit, aspernatur aut odit aut fugit, sed quia consequuntur magni dolores eos, qui ratione voluptatem sequi nesciunt, neque porro...',
];
